// 大产品编号
export const prodIds = {
  // 价值
  hot: '1588015',
  // 热点
  price: '1588016',
  // 热点追击
  prodStrategy: '1588020',
  // 如影随形
  shadowFollow: '1588021',
  // 主题策略
  themeProd: '1588030',
  //  首席策略
  chiefProd: '1588033',
  //  hurst量化
  hurstProd: '1588034'
}

export const protocolList = {
  1588016: '17010,17009,17006,17007',
  1588020: '17011,17009,17006,17007',
  1588021: '17012,17009,17006,17007',
  1588030: '17013,17009,17006,17007',
  1588034: '17014,17009,17006,17007',
  1588033: '17015,17009,17006,17007',
  1500000: '17018,17009,17006,17007'
}

//  风险承受能力等级
export const proRiskLevel = {
  1: 'R1(低风险)',
  2: 'R2(中低风险)',
  3: 'R3(中风险)',
  4: 'R4(中高风险)',
  5: 'R5(高风险)'
}

//  风险承受能力
export const clientRiskLevel = {
  1: '低风险承受能力',
  2: '中低风险承受能力',
  3: '中风险承受能力',
  4: '中高风险承受能力',
  5: '高风险承受能力'
}

export const InvestorType = {
  '0': '普通投资者',
  '1': '专业投资者'
}

export const clientRiskType = {
  0: '保守型(最低类别)',
  1: '保守型',
  2: '谨慎型',
  3: '稳健型',
  4: '积极型',
  5: '激进型'
}
